In [1]:
#Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [2]:
# csv_file pathing
fertility_rate_path = "Resource/fred_fertility_rates.csv"
living_arrangements_path = "Resource/census_living_arrangements.csv"
marital_status_path = "Resource/marital status overtime.csv"
age_fertility_path = "Resource/Age_Fertility.csv"
education_path = "Resource/Female Education Attainment Level.csv"

In [3]:
# Raw DataFrame Prep: Fertility Rates

fertility_rate_df = pd.read_csv(fertility_rate_path).dropna()
fertility_rate_df['DATE'] = pd.to_datetime(fertility_rate_df['DATE'].str.strip(), format='%d/%m/%Y').dt.year
fertility_rate_df.rename(columns = {'SPDYNTFRTINUSA':'fertility_rate','DATE':'Year'}, inplace = True) 

print(f'{len(fertility_rate_df)} records')
fertility_rate_df.head()

# Print to csv - remove hashmark in front of below code to export to csv
# fertility_rate_df.to_csv("Output/fertility_rate.csv", index=False, header=True)

59 records

   Year  fertility_rate
0  1960           3.654
1  1961           3.620
2  1962           3.461
3  1963           3.319
4  1964           3.190

In [4]:
# Raw DataFrame Prep: Living Arrangements

# Read csv, drop na
living_arrangements_df = pd.read_csv(living_arrangements_path).dropna()

# Merge with fertility rates
merge_living_df = pd.merge(fertility_rate_df, living_arrangements_df, on="Year", how="outer")

# Print and display
print(f'{len(merge_living_df)} records')
merge_living_df.head()

# Print to csv - remove hashmark in front of below code to export to csv
# merge_living_df.to_csv("Output/living_arrangements.csv", index=False, header=True)

60 records

,Year,fertility_rate,under_18,two_parents,mother_only,father_only,other_relatives,non_relatives
0,1960,3.654,63727.0,55877.0,5105.0,724.0,1601.0,420.0
1,1961,3.620,NaN,NaN,NaN,NaN,NaN,NaN
2,1962,3.461,NaN,NaN,NaN,NaN,NaN,NaN
3,1963,3.319,NaN,NaN,NaN,NaN,NaN,NaN
4,1964,3.190,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# Raw DataFrame Prep: Marital Status

# Read csv, drop na
marital_status_df = pd.read_csv(marital_status_path).dropna()

# Merge with fertility rates
merge_marital_df = pd.merge(fertility_rate_df, marital_status_df, on="Year", how="outer")

# Print and display
print(f'{len(merge_marital_df)} records')
merge_marital_df.head()

# Print to csv - remove hashmark in front of below code to export to csv
# merge_marital_df.to_csv("Output/marital_status.csv", index=False, header=True)

61 records

,Year,fertility_rate,Men Total,Married Men,Unmarried Men Total,Never Married Men,Widowed Men,Divorced Men,Women Total,Married Women,Unmarried Women Total,Never Married Women,Widowed Women,Divorced Women
0,1960,3.654,"60,273","41,781","18,492","15,274","2,112","1,106","64,607","42,583","22,024","12,252","8,064","1,708"
1,1961,3.620,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1962,3.461,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1963,3.319,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964,3.190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
# Raw DataFrame Prep: Fertility by Age

# Read csv
age_fertility_df = pd.read_csv(age_fertility_path)

# Clean
age_fertility_df = age_fertility_df[['Year', 'Age 10-14 Years', 'Age 15-19 Years', 'Age 20-24 Years',
                           'Age 25-29 Years', 'Age 30-34 Years', 'Age 35-39 Years', 'Age 40-44 Years', 'Age 45-49 Years']]

# Merge with fertility rates
merge_age_df = pd.merge(fertility_rate_df, age_fertility_df, on="Year", how="outer")

# Print and display
print(f'{len(merge_age_df)} records')
merge_age_df.head()

# Print to csv - remove hashmark in front of below code to export to csv
# merge_age_df.to_csv("Output/fertility_age.csv", index=False, header=True)

73 records

,Year,fertility_rate,Age 10-14 Years,Age 15-19 Years,Age 20-24 Years,Age 25-29 Years,Age 30-34 Years,Age 35-39 Years,Age 40-44 Years,Age 45-49 Years
0,1960,3.654,0.8,89.1,258.1,197.4,112.7,56.2,15.5,0.9
1,1961,3.620,0.9,88.6,251.9,197.5,113.2,55.6,15.6,0.9
2,1962,3.461,0.8,81.4,241.9,191.1,108.6,52.6,14.9,0.9
3,1963,3.319,0.9,76.7,229.1,185.1,105.8,51.2,14.2,0.9
4,1964,3.190,0.9,73.1,217.5,178.7,103.4,49.9,13.8,0.8

In [7]:
# Raw DataFrame Prep: Female Education Attainment Level

# Read csv and drop na
education_df = pd.read_csv(education_path).dropna()

# Clean
education_df.rename(columns = {'Years':'Year'}, inplace=True)

# Merge with fertility rates
merge_education_df = pd.merge(fertility_rate_df, education_df, on="Year", how="outer")

# Print and display
print(f'{len(merge_education_df)} records')
merge_education_df.head()

# Print to csv - remove hashmark in front of below code to export to csv
# merge_education_df.to_csv("Output/education.csv", index=False, header=True)

66 records

,Year,fertility_rate,Total # in thousands,e0 - 4,e5 - 8,hs0 - 3,hs4,c0 - 3,c4
0,1960,3.654,"51,468",7.30%,30.40%,19.70%,27.70%,9.00%,5.80%
1,1961,3.620,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1962,3.461,"52,381",6.90%,27.70%,17.90%,31.60%,9.30%,6.70%
3,1963,3.319,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1964,3.190,"53,447",6.20%,26.40%,18.50%,33.40%,8.80%,6.80%

In [8]:
#drop NaN
clean_martial_df=merge_marital_df.dropna(how="any")
clean_martial_df.head()

,Year,fertility_rate,Men Total,Married Men,Unmarried Men Total,Never Married Men,Widowed Men,Divorced Men,Women Total,Married Women,Unmarried Women Total,Never Married Women,Widowed Women,Divorced Women
0,1960,3.6540,"60,273","41,781","18,492","15,274","2,112","1,106","64,607","42,583","22,024","12,252","8,064","1,708"
10,1970,2.4800,"70,559","47,109","23,450","19,832","2,051","1,567","77,766","48,148","29,618","17,167","9,734","2,717"
20,1980,1.8395,"81,947","51,813","30,134","24,227","1,977","3,930","89,914","52,965","36,950","20,226","10,758","5,966"
30,1990,2.0810,"91,955","55,833","36,121","27,505","2,333","6,283","99,838","56,797","43,040","22,718","11,477","8,845"
33,1993,2.0195,"94,854","56,833","38,021","28,775","2,468","6,778","102,400","57,768","44,631","23,534","11,214","9,883"

In [9]:
#got the columns name
clean_martial_df.columns

Index(['Year', 'fertility_rate', 'Men Total', 'Married Men',
       'Unmarried Men Total', 'Never Married Men', 'Widowed Men',
       'Divorced Men', 'Women Total', 'Married Women',
       'Unmarried Women Total ', 'Never Married Women', 'Widowed Women',
       'Divorced Women'],
      dtype='object')

In [10]:
clean_martial_df1 = clean_martial_df.apply(pd.to_numeric,errors = 'ignore')
clean_martial_df1.dtypes

Year                        int64
fertility_rate            float64
Men Total                  object
Married Men                object
Unmarried Men Total        object
Never Married Men          object
Widowed Men                object
Divorced Men               object
Women Total                object
Married Women              object
Unmarried Women Total      object
Never Married Women        object
Widowed Women              object
Divorced Women             object
dtype: object

In [11]:
clean_martial_df1.head()

,Year,fertility_rate,Men Total,Married Men,Unmarried Men Total,Never Married Men,Widowed Men,Divorced Men,Women Total,Married Women,Unmarried Women Total,Never Married Women,Widowed Women,Divorced Women
0,1960,3.6540,"60,273","41,781","18,492","15,274","2,112","1,106","64,607","42,583","22,024","12,252","8,064","1,708"
10,1970,2.4800,"70,559","47,109","23,450","19,832","2,051","1,567","77,766","48,148","29,618","17,167","9,734","2,717"
20,1980,1.8395,"81,947","51,813","30,134","24,227","1,977","3,930","89,914","52,965","36,950","20,226","10,758","5,966"
30,1990,2.0810,"91,955","55,833","36,121","27,505","2,333","6,283","99,838","56,797","43,040","22,718","11,477","8,845"
33,1993,2.0195,"94,854","56,833","38,021","28,775","2,468","6,778","102,400","57,768","44,631","23,534","11,214","9,883"

In [16]:
men_df=clean_martial_df1[['Year', 'fertility_rate', 'Men Total', 'Married Men',
       'Unmarried Men Total', 'Never Married Men', 'Widowed Men',
       'Divorced Men']]
men_df.head()

,Year,fertility_rate,Men Total,Married Men,Unmarried Men Total,Never Married Men,Widowed Men,Divorced Men
0,1960,3.6540,"60,273","41,781","18,492","15,274","2,112","1,106"
10,1970,2.4800,"70,559","47,109","23,450","19,832","2,051","1,567"
20,1980,1.8395,"81,947","51,813","30,134","24,227","1,977","3,930"
30,1990,2.0810,"91,955","55,833","36,121","27,505","2,333","6,283"
33,1993,2.0195,"94,854","56,833","38,021","28,775","2,468","6,778"

In [ ]:
men_total=men_df["Men Total"]
married_m=men_df["Married Men"]
single_m=men_df["Never Married Men"]
unm_m=men_df["Unmarried Men Total"]